public/programming/gists/c/left_space.c.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../gists.html">Gists</a> &gt;
</p>
<div id="outline-container-org840b958" class="outline-2">
<h2 id="org840b958">C / left_space.c</h2>
<div class="outline-text-2" id="text-org840b958">
<p>
Get number of separator charactes from the left of a string in C99.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #989898;">// </span><span style="color: #989898;">SPDX-License-Identifier: MIT
</span><span style="color: #989898;">// </span><span style="color: #989898;">Author: Giovanni Santini
</span><span style="color: #989898;">// </span><span style="color: #989898;">Github: @San7o
</span>
<span style="color: #989898;">// </span><span style="color: #989898;">Get number of separator charactes from the left of string
</span><span style="color: #989898;">//</span><span style="color: #989898;">
</span><span style="color: #989898;">// </span><span style="color: #989898;">Get the number of separator characters from the left of [input]
</span><span style="color: #989898;">// </span><span style="color: #989898;">until the first non-separator or [input_size]. Separator characters
</span><span style="color: #989898;">// </span><span style="color: #989898;">are specs, new lines and tabs. Updates [line] and/or [column] if
</span><span style="color: #989898;">// </span><span style="color: #989898;">non null.
</span><span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">left_space</span>(<span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">char</span>* <span style="color: #00d3d0;">input</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">input_size</span>,
               <span style="color: #6ae4b9;">unsigned</span> <span style="color: #6ae4b9;">int</span>* <span style="color: #00d3d0;">line</span>, <span style="color: #6ae4b9;">unsigned</span> <span style="color: #6ae4b9;">int</span>* <span style="color: #00d3d0;">column</span>)
{
  <span style="color: #b6a0ff;">if</span> (<span style="color: #ff5f59; font-weight: bold;">!</span>input || input_size == 0) <span style="color: #b6a0ff;">return</span> 0;

  <span style="color: #6ae4b9;">int</span> <span style="color: #00d3d0;">pos</span> = 0;
  <span style="color: #b6a0ff;">while</span>(pos &lt; input_size &amp;&amp;
        (input[pos] == <span style="color: #79a8ff;">' '</span> ||
         input[pos] == <span style="color: #79a8ff;">'\n'</span> ||
         input[pos] == <span style="color: #79a8ff;">'\t'</span>))
  {
    <span style="color: #b6a0ff;">if</span> (input[pos] == <span style="color: #79a8ff;">'\n'</span>) {
      <span style="color: #b6a0ff;">if</span> (line) (*line)++;
      <span style="color: #b6a0ff;">if</span> (column) *column = 0;
    } <span style="color: #b6a0ff;">else</span> {
      <span style="color: #b6a0ff;">if</span> (column) (*column)++;
    }
    pos++;
  }

  <span style="color: #b6a0ff;">return</span> pos;
}
</pre>
</div>


<hr />

<p>
Travel: <a href="../gists.html">Gists</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
